{
  "title": {
    "text": {
      "headline": "Iran’s Nuclear Timeline",
      "text": "Key events in the development of Iran’s nuclear program from 1957 to present."
    }
  },
  "events": [
    {
      "start_date": {
        "year": 1957,
        "month": 3,
        "day": 5,
        "display_date": "Mar 5, 1957"
      },
      "text": {
        "headline": "Atoms for Peace: US-Iran Nuclear Cooperation",
        "text": "The United States and Iran sign a civil nuclear cooperation agreement as part of President Eisenhower’s Atoms for Peace program​en.wikipedia.org\n. Under the pro-Western rule of Shah Mohammad Reza Pahlavi, Iran begins receiving technical assistance for a peaceful nuclear program. This lays the foundation for Iran’s nuclear ambitions during the 1960s–70s."
      }
    },
    {
      "start_date": {
        "year": 1963,
        "month": 8,
        "day": 9,
        "display_date": "Aug 9, 1963"
      },
      "text": {
        "headline": "Nonproliferation: Iran Joins Test Ban Treaty",
        "text": "Under the Shah’s government, Iran signs the Partial Nuclear Test Ban Treaty (PTBT), which bans nuclear weapons tests in the atmosphere, in outer space, and underwater​en.wikipedia.org\n. (Iran ratifies the treaty in December 1963.) This early commitment to nonproliferation reflects Iran’s alignment with global arms-control norms during the 1960s."
      }
    },
    {
      "start_date": {
        "year": 1968,
        "month": 7,
        "day": 1,
        "display_date": "Jul 1, 1968"
      },
      "text": {
        "headline": "Iran Signs the NPT",
        "text": "Iran becomes an original signatory of the Nuclear Non-Proliferation Treaty (NPT) when it opens for signature on July 1, 1968​en.wikipedia.org\n. (Iran formally ratifies the NPT in 1970, under the Shah’s rule.) By joining the NPT, Iran pledges not to seek nuclear weapons and to accept IAEA safeguards on its nuclear activities, in exchange for access to peaceful nuclear technology​en.wikipedia.org\n."
      }
    },
    {
      "start_date": {
        "year": 1970,
        "month": 1,
        "day": 1,
        "display_date": "Jan 1, 1970"
      },
      "text": {
        "headline": "Ambitious Expansion under the Shah",
        "text": "Iran’s ruler, Shah Pahlavi, establishes the Atomic Energy Organization of Iran (AEOI) and announces plans to build up to 23 nuclear power reactors (totaling 23,000 MW) over two decades​armscontrol.org\n​en.wikipedia.org\n. Contracts are signed with Western firms: e.g. West Germany’s Siemens begins constructing two reactors at Bushehr​en.wikipedia.org\n. This aggressive program – backed by the U.S. and Europe – aims to give Iran a full nuclear fuel cycle capability. (The Atomic Energy Act of Iran is also passed in 1974, outlining the AEOI’s mandate​en.wikipedia.org\n.)"
      }
    },
    {
      "start_date": {
        "year": 1970,
        "month": 1,
        "day": 1,
        "display_date": "Jan 1, 1970"
      },
      "text": {
        "headline": "Infrastructure Building",
        "text": "Iran contracts the Massachusetts Institute of Technology (MIT) to train Iranian nuclear engineers​en.wikipedia.org\n, and buys a 15% share in the Rössing uranium mine in Namibia​en.wikipedia.org\n. These steps are meant to develop indigenous expertise and secure uranium supply for the Shah’s burgeoning nuclear program. (However, due to international pressure and later sanctions, Iran never reaps significant benefits from the Rössing investment​en.wikipedia.org\n.)"
      }
    },
    {
      "start_date": {
        "year": 1979,
        "month": 2,
        "day": 1,
        "display_date": "Feb 1, 1979"
      },
      "text": {
        "headline": "Revolution: Program Halted",
        "text": "The Islamic Revolution topples the Shah and brings Ayatollah Ruhollah Khomeini to power, leading to a freeze of Iran’s nuclear program. Western firms withdraw from projects – for example, construction of the Bushehr reactors is halted as the German contractor leaves​en.wikipedia.org\n. Iran’s new revolutionary regime distrusts nuclear technology (initially calling it a “taghut” relic of the Shah) and for several years virtually all nuclear development is suspended."
      }
    },
    {
      "start_date": {
        "year": 1984,
        "month": 1,
        "day": 19,
        "display_date": "Jan 19, 1984"
      },
      "text": {
        "headline": "Sanctions: Iran Isolated",
        "text": "The United States designates Iran as a state sponsor of terrorism, triggering wide-ranging sanctions​armscontrol.org\n. This complicates Iran’s nuclear efforts by cutting off remaining Western assistance. Throughout the 1980s, amid the Iran–Iraq War, Iran’s nuclear work is minimal – though by 1987 Iran clandestinely acquires centrifuge blueprints and parts from the Abdul Qadeer Khan network in Pakistan​armscontrol.org\n, initiating a secret uranium enrichment program."
      }
    },
    {
      "start_date": {
        "year": 1995,
        "month": 1,
        "day": 1,
        "display_date": "Jan 1, 1995"
      },
      "text": {
        "headline": "Bushehr Reactor Deal",
        "text": "Iran signs an $800 million contract with Russia to resume construction of the Bushehr nuclear power plant​en.wikipedia.org\n. Under President Akbar Hashemi Rafsanjani (and Supreme Leader Khamenei), Iran turns to the Soviet/Russian Atomic Energy Ministry (MinAtom) after Western companies refused to complete the Shah’s project. Russia agrees to finish one 1,000 MW light-water reactor at Bushehr and provide fuel, with provisions that spent fuel will be returned to Russia​armscontrol.org\n. This marks the revival of Iran’s nuclear program after the post-revolution hiatus."
      }
    },
    {
      "start_date": {
        "year": 1970,
        "month": 1,
        "day": 1,
        "display_date": "Jan 1, 1970"
      },
      "text": {
        "headline": "Pursuit of Enrichment",
        "text": "China and Iran inform the IAEA of plans to construct a uranium enrichment facility in Iran, but China withdraws from the deal under U.S. pressure​en.wikipedia.org\n. Iran notifies the IAEA that it will pursue indigenous enrichment anyway​en.wikipedia.org\n. During the 1990s, Iran covertly builds pilot enrichment plants and seeks technology abroad. U.S. sanctions intensify (e.g. the 1996 Iran-Libya Sanctions Act penalizing energy investments) to impede foreign assistance."
      }
    },
    {
      "start_date": {
        "year": 2002,
        "month": 8,
        "day": 1,
        "display_date": "Aug 1, 2002"
      },
      "text": {
        "headline": "Secret Sites Exposed (Natanz & Arak)",
        "text": "In August 2002, an Iranian opposition group (NCRI) reveals two hidden nuclear sites: a large uranium enrichment facility under construction at Natanz and a heavy-water reactor project at Arak​en.wikipedia.org\n. The Natanz site – intended for thousands of gas centrifuges – and the Arak IR-40 reactor (which could yield plutonium) had not been declared to the IAEA, sparking global concern​en.wikipedia.org\n. Iran, led by President Mohammad Khatami and Supreme Leader Khamenei, initially downplays the revelations but agrees to intensified inspections under international pressure."
      }
    },
    {
      "start_date": {
        "year": 2003,
        "month": 6,
        "day": 16,
        "display_date": "Jun 16, 2003"
      },
      "text": {
        "headline": "IAEA Uncovers Failures",
        "text": "IAEA Director-General Mohamed ElBaradei reports that Iran has failed to declare certain nuclear materials and activities, in violation of its safeguards obligations​en.wikipedia.org\n. The Agency’s inspections find traces of highly enriched uranium at Kalaye Electric in Tehran (indicating undeclared experiments) and other discrepancies. ElBaradei urges “accelerated cooperation” from Iran​en.wikipedia.org\n. Iran insists its program is peaceful and eventually agrees to some transparency measures, hoping to avert a referral to the UN Security Council at this stage."
      }
    },
    {
      "start_date": {
        "year": 2003,
        "month": 10,
        "day": 21,
        "display_date": "Oct 21, 2003"
      },
      "text": {
        "headline": "Tehran Declaration: Enrichment Suspended",
        "text": "Iran and the “EU-3” (Britain, France, Germany) reach a deal in Tehran: Iran agrees to voluntarily suspend all uranium enrichment and reprocessing activities and to sign the IAEA Additional Protocol for more intrusive inspections​en.wikipedia.org\n. In return, the European powers acknowledge Iran’s right to peaceful nuclear energy and promise cooperation​en.wikipedia.org\n. This Paris Agreement is a confidence-building measure under President Khatami’s reformist government, seeking to avoid UN sanctions. Over the next year, Iran implements the suspension and expanded inspections while negotiating a longer-term agreement with the EU."
      }
    },
    {
      "start_date": {
        "year": 2003,
        "month": 11,
        "day": 1,
        "display_date": "Nov 1, 2003"
      },
      "text": {
        "headline": "IAEA Reports No Bomb Evidence, But Breaches",
        "text": "In November 2003, the IAEA issues a comprehensive report detailing Iran’s past safeguards breaches (e.g. undeclared import of uranium, secret enrichment research) and a “policy of concealment.” However, the report also states that inspectors found no evidence of an actual nuclear weapons program in Iran​en.wikipedia.org\n. The U.S. (under President George W. Bush) remains skeptical, but the IAEA Board stops short of declaring Iran in non-compliance at that time. Iran, having provided a dossier of its nuclear activities, is not referred to the UN Security Council – as long as it maintains the suspension and cooperation."
      }
    },
    {
      "start_date": {
        "year": 2003,
        "month": 12,
        "day": 18,
        "display_date": "Dec 18, 2003"
      },
      "text": {
        "headline": "Additional Protocol Signed",
        "text": "As part of the Paris Agreement commitments, Iran signs the Additional Protocol to its IAEA safeguards, allowing snap inspections and much more intrusive monitoring​en.wikipedia.org\n. From late 2003 through 2004, Iran voluntarily implements the Additional Protocol (even though the Iranian parliament did not ratify it)​en.wikipedia.org\n. The IAEA conducts numerous inspections under the AP, which do not uncover a bomb program. Iran’s willingness to accept enhanced inspections at this stage is tied to hopes of a diplomatic resolution that would recognize Iran’s nuclear rights and lift U.S. sanctions."
      }
    },
    {
      "start_date": {
        "year": 2004,
        "month": 11,
        "day": 15,
        "display_date": "Nov 15, 2004"
      },
      "text": {
        "headline": "Last-Minute Deal with EU-3",
        "text": "After difficult negotiations, Iran and the EU-3 agree on a further suspension of Iran’s enrichment-related work (the Paris Agreement of November 2004)​en.wikipedia.org\n​armscontrol.org\n. Iran extends the freeze on uranium conversion and enrichment activities beyond the initial October 2003 deal​en.wikipedia.org\n. In return, the Europeans promise to negotiate an incentive package for Iran, including potential nuclear fuel guarantees and economic benefits. Iran’s chief negotiator Hassan Rouhani (under President Khatami) accepts this interim compromise, but internally, Iranian hard-liners grow frustrated that the suspension has lasted too long without tangible rewards."
      }
    },
    {
      "start_date": {
        "year": 2005,
        "month": 8,
        "day": 8,
        "display_date": "Aug 8, 2005"
      },
      "text": {
        "headline": "Enrichment Resumed; Khamenei’s Fatwa",
        "text": "With the election of hardliner Mahmoud Ahmadinejad as president (and following the stalled talks with Europe), Iran ends its voluntary suspension. On Aug. 8, 2005, Iran restarts uranium conversion at the Isfahan plant, preparing feedstock (UF₆ gas) for enrichment​armscontrol.org\n. Shortly after, the new government also resumes building centrifuges at Natanz. Around the same time, Supreme Leader Ali Khamenei issues a fatwa (religious decree) declaring nuclear weapons forbidden in Islam​en.wikipedia.org\n. Iranian officials repeatedly cite this fatwa as evidence that Iran’s intentions are peaceful. Despite the decree, Iran’s enrichment work accelerates under Ahmadinejad."
      }
    },
    {
      "start_date": {
        "year": 2005,
        "month": 9,
        "day": 24,
        "display_date": "Sep 24, 2005"
      },
      "text": {
        "headline": "IAEA Finds Iran in Non-Compliance",
        "text": "The IAEA Board of Governors, in a divided vote, formally declares Iran in non-compliance with its safeguards agreement – largely based on the past concealment of activities reported in 2003​armscontrol.org\n. This resolution deems Iran’s nuclear file subject to Security Council action. Tehran denounces the decision as politically motivated. (The file is not immediately referred to the UN; the IAEA delays escalation to allow a last chance for diplomacy.) Tensions grow as Iran insists on its NPT right to enrichment, while Western powers suspect Iran’s program could be a cover for bomb ambitions."
      }
    },
    {
      "start_date": {
        "year": 2006,
        "month": 2,
        "day": 4,
        "display_date": "Feb 4, 2006"
      },
      "text": {
        "headline": "Reported to UN Security Council",
        "text": "After Iran breaks the suspension (and a final EU-3 proposal fails), an emergency meeting of the IAEA Board refers Iran to the United Nations Security Council​armscontrol.org\n. Iran reacts angrily: it ends voluntary implementation of the Additional Protocol and limits inspector access​en.wikipedia.org\n. This marks a turning point where Iran’s file becomes a Security Council matter. The UNSC begins demanding that Iran suspend enrichment entirely. Iranian President Ahmadinejad defiantly declares Iran will continue its nuclear fuel cycle activities, rallying nationalist support at home in the face of potential international sanctions."
      }
    },
    {
      "start_date": {
        "year": 2006,
        "month": 4,
        "day": 11,
        "display_date": "Apr 11, 2006"
      },
      "text": {
        "headline": "“Nuclear Club”: First Enrichment Achieved",
        "text": "President Ahmadinejad triumphantly announces that Iran has successfully enriched uranium to 3.5% U-235 (low-enriched uranium suitable for power reactors) using a cascade of 164 centrifuges at Natanz​en.wikipedia.org\n. “Iran has joined the nuclear club,” he proclaims, celebrating this as a national milestone​en.wikipedia.org\n. Iran insists this enrichment work is for peaceful fuel production and continues to reject allegations of seeking a weapon. However, the achievement triggers alarm in the West and Israel, as Iran has mastered the basic enrichment technology. Calls for UN action intensify given Iran’s refusal to suspend these activities."
      }
    },
    {
      "start_date": {
        "year": 2006,
        "month": 7,
        "day": 31,
        "display_date": "Jul 31, 2006"
      },
      "text": {
        "headline": "UN Demands Suspension – Resolution 1696",
        "text": "The UN Security Council adopts Resolution 1696, under Chapter VII, demanding Iran suspend all enrichment-related and reprocessing activities by August 31, 2006​en.wikipedia.org\n. It passes with 14 votes in favor (Qatar dissents)​en.wikipedia.org\n. The resolution warns of sanctions if Iran does not comply. Iran’s UN ambassador rejects 1696 as “arbitrary” and illegal, citing Iran’s NPT right to peaceful nuclear technology​en.wikipedia.org\n. Supreme Leader Khamenei and President Ahmadinejad vow to continue enrichment, and indeed Iran does not suspend. This resolution sets the stage for a series of UN sanctions after Iran’s non-compliance."
      }
    },
    {
      "start_date": {
        "year": 2006,
        "month": 12,
        "day": 23,
        "display_date": "Dec 23, 2006"
      },
      "text": {
        "headline": "UN Sanctions Begin – Resolution 1737",
        "text": "With Iran still defiant, the UNSC unanimously approves Resolution 1737, imposing the first round of sanctions on Iran’s nuclear program​en.wikipedia.org\n. The sanctions ban trade in sensitive nuclear materials and technology, freeze assets of certain Iranian entities and individuals involved in the program, and prohibit support for Iran’s heavy-water project​en.wikipedia.org\n. This marks Iran’s debut under UN sanctions for its nuclear activities. Iran’s government decries the move and accelerates enrichment to show it won’t back down. Internally, however, sanctions begin to bite, and more pragmatic voices in Tehran consider returning to negotiations in the coming years."
      }
    },
    {
      "start_date": {
        "year": 2007,
        "month": 3,
        "day": 24,
        "display_date": "Mar 24, 2007"
      },
      "text": {
        "headline": "Further UN Sanctions – Resolution 1747",
        "text": "The Security Council unanimously adopts Resolution 1747, expanding sanctions due to Iran’s failure to heed 1696/1737​en.wikipedia.org\n. Res 1747 tightens the embargo: it bans Iranian arms exports and adds more names to asset freezes and travel bans​en.wikipedia.org\n. Notably, it calls on states to restrict new assistance or loans to Iran. In response, Iran limits cooperation with the IAEA to basic NPT safeguards. Shortly after, in April 2007, Ahmadinejad announces Iran can now enrich uranium on an “industrial scale” – operating 3,000 centrifuges​en.wikipedia.org\n – signaling Tehran’s resolve to press forward despite UN pressure."
      }
    },
    {
      "start_date": {
        "year": 2007,
        "month": 4,
        "day": 9,
        "display_date": "Apr 9, 2007"
      },
      "text": {
        "headline": "“Industrial-Scale” Enrichment",
        "text": "Ahmadinejad declares that Iran’s nuclear fuel cycle is now working at an industrial level, as the Natanz facility reportedly has 3,000 centrifuges operating​en.wikipedia.org\n. This suggests Iran’s LEU production capability is growing. (IAEA later confirms Iran is steadily installing and running more IR-1 centrifuges.) On the same date (National Nuclear Technology Day), Iran inaugurates the enrichment of uranium on a larger scale. The international community sees this as provocative. IAEA chief ElBaradei warns against “new crazies who say ‘let’s go bomb Iran’,” urging diplomacy​en.wikipedia.org\n. The stage is set for a prolonged standoff."
      }
    },
    {
      "start_date": {
        "year": 2007,
        "month": 12,
        "day": 3,
        "display_date": "Dec 3, 2007"
      },
      "text": {
        "headline": "US NIE: Weapons Program Halted in 2003",
        "text": "A U.S. National Intelligence Estimate (NIE) publicly reports that Iran halted its nuclear weapons program in fall 2003 and had not resumed it as of mid-2007​en.wikipedia.org\n. This surprise finding – “with high confidence” – asserts Iran stopped warhead design and other weaponization work in 2003 (after the Iraq War began and Iran was exposed), though Iran continues enrichment and keeps the option open​en.wikipedia.org\n. The NIE judges Iran is not currently trying to build a bomb, contradicting some earlier Western assumptions. While Israel and some Western officials dispute aspects of the NIE, its publication complicates efforts to build pressure for military action and bolsters calls for renewed diplomacy with Iran."
      }
    },
    {
      "start_date": {
        "year": 2008,
        "month": 3,
        "day": 3,
        "display_date": "Mar 3, 2008"
      },
      "text": {
        "headline": "UN Resolution 1803: More Sanctions",
        "text": "The Security Council passes Resolution 1803, a third round of sanctions, with 14–0 (Indonesia abstains)​en.wikipedia.org\n. Res 1803 broadens financial sanctions, bans more dual-use nuclear/missile items, and expands travel bans and asset freezes​en.wikipedia.org\n. It also calls on states to inspect cargo suspected of carrying prohibited items to Iran. Iran’s nuclear and missile agencies face increasing isolation. Meanwhile, Iran receives the final shipments of nuclear fuel for Bushehr from Russia by late 2008​en.wikipedia.org\n. Tehran continues to reject UN demands, maintaining its enrichment work while weathering the growing economic pressure."
      }
    },
    {
      "start_date": {
        "year": 2009,
        "month": 9,
        "day": 25,
        "display_date": "Sep 25, 2009"
      },
      "text": {
        "headline": "Fordow Site Revealed",
        "text": "U.S. President Barack Obama, joined by France and Britain, announces that Iran has been secretly building a second enrichment facility near Fordow, buried deep in a mountain near Qom​armscontrol.org\n. Iran had informed the IAEA of Fordow only days earlier, after learning the site was compromised​armscontrol.org\n. The plant’s covert construction (project started in 2006) heightens suspicions of Iran’s intentions. Iran defends Fordow as a backup enrichment site protected from attack, not yet operational at the time of exposure. The revelation erodes confidence in Iran’s transparency and leads to a unified P5+1 front pressing for harsher sanctions if Iran refuses to curb its nuclear work."
      }
    },
    {
      "start_date": {
        "year": 2009,
        "month": 10,
        "day": 1,
        "display_date": "Oct 1, 2009"
      },
      "text": {
        "headline": "Geneva Fuel-Swap Talks",
        "text": "In Geneva, Iran and the P5+1 agree in principle on a fuel swap deal: Iran would ship out the majority of its low-enriched uranium (LEU) stockpile to be converted into fuel for the Tehran Research Reactor​armscontrol.org\n. The proposal – brokered by the IAEA – aims to reduce Iran’s LEU stock (limiting breakout potential) while providing Iran with 20%-enriched fuel for medical isotopes. Initially, Iran’s negotiators (under President Ahmadinejad) seem receptive. However, the deal faces criticism from Iranian hard-liners; by 2010 Iran reneges on the original terms, seeking changes. The tentative Geneva understanding ultimately falls apart, leading to further diplomatic deadlock."
      }
    },
    {
      "start_date": {
        "year": 2010,
        "month": 2,
        "day": 9,
        "display_date": "Feb 9, 2010"
      },
      "text": {
        "headline": "20% Enrichment for TRR",
        "text": "Iran begins enriching uranium to 20% U-235 at Natanz, ostensibly to fabricate fuel for the Tehran Research Reactor which produces medical isotopes​armscontrol.org\n. This step—raising enrichment from 3.5% to 20%—moves Iran significantly closer to weapons-grade if it chose to pursue that route. (20% is technically “high enriched” uranium.) Western officials voice alarm, as 20% material can be relatively quickly enriched to bomb-grade. Iran insists the move is necessary after an international fuel swap deal stalled. The enrichment to 20% and stockpiling of this material becomes one of the most contentious issues in subsequent negotiations."
      }
    },
    {
      "start_date": {
        "year": 2010,
        "month": 6,
        "day": 9,
        "display_date": "Jun 9, 2010"
      },
      "text": {
        "headline": "UN Resolution 1929: Comprehensive Sanctions",
        "text": "The UNSC approves Resolution 1929, the fourth and most sweeping round of sanctions against Iran​armscontrol.org\n. Res 1929 bans Iran from ballistic missile launches capable of carrying nukes, prohibits major conventional arms sales to Iran, and expands financial sanctions – targeting the IRGC and Iran’s shipping, banking, and energy sectors​armscontrol.org\n. It also authorizes states to inspect Iranian cargo suspected of containing banned items. This “maximum pressure” of the time is aimed at bringing Iran back to negotiations on Western terms. Iran’s economy begins suffering more acutely. In response, Iran boycotts talks for months and continues to expand its enrichment capacity."
      }
    },
    {
      "start_date": {
        "year": 2010,
        "month": 9,
        "day": 1,
        "display_date": "Sep 1, 2010"
      },
      "text": {
        "headline": "Stuxnet Cyberattack",
        "text": "A sophisticated computer worm known as Stuxnet is identified; it had secretly infiltrated Iran’s Natanz facility earlier, causing centrifuges to malfunction​armscontrol.org\n. The malware – widely reported to be a joint U.S.-Israeli cyber operation – specifically targeted Iran’s IR-1 centrifuges, destroying perhaps up to 1,000 machines. This marks the first known major cyber-sabotage of a nuclear program. While Iran replaces the damaged centrifuges, the attack slows its progress in 2010. Iranian officials later acknowledge the “electronic attack,” and it feeds Tehran’s perceptions of a covert war being waged against its nuclear program by adversaries."
      }
    },
    {
      "start_date": {
        "year": 2010,
        "display_date": "2010–2012"
      },
      "text": {
        "headline": "Scientists Assassinated",
        "text": "During 2010–2012, four Iranian nuclear scientists are assassinated in Tehran in separate attacks widely attributed to Israel’s Mossad​voanews.com\n​voanews.com\n. – Jan 12, 2010: Masoud Ali Mohammadi, physics professor (killed by a booby-trapped motorcycle)​voanews.com\n. – Nov 29, 2010: Majid Shahriari, nuclear engineer (killed by a magnetic bomb; another scientist, Fereydoun Abbasi, wounded)​voanews.com\n. – July 23, 2011: Darioush Rezaeinejad, electronics expert (shot dead outside his home)​voanews.com\n. – Jan 11, 2012: Mostafa Ahmadi-Roshan, Natanz facility manager (killed by car bomb)​voanews.com\n. Iran accuses Israel and the U.S. of a campaign of “nuclear terrorism.” These incidents severely rattle Iran’s scientific community but do not halt the nuclear program’s technical progress."
      }
    },
    {
      "start_date": {
        "year": 2011,
        "month": 5,
        "day": 8,
        "display_date": "May 8, 2011"
      },
      "text": {
        "headline": "Bushehr Reactor Goes Online",
        "text": "Bushehr-1, Iran’s first nuclear power reactor, finally begins operation. After decades of delay, the Russian-built 1000 MW pressurized-water reactor achieved an initial chain reaction in May 2011​armscontrol.org\n and is connected to the electrical grid by September 2011. Iran’s Atomic Energy Organization declares Bushehr officially operational, marking the fruition of the Shah’s 1970s project under the Islamic Republic​armscontrol.org\n. Bushehr is under full IAEA safeguards and Russia supplies its fuel and takes back spent fuel. This milestone gives Iran a symbol of nuclear achievement for peaceful use."
      }
    },
    {
      "start_date": {
        "year": 2011,
        "month": 11,
        "day": 8,
        "display_date": "Nov 8, 2011"
      },
      "text": {
        "headline": "IAEA Details “Possible Military Dimensions”",
        "text": "IAEA Director-General Yukiya Amano issues a report documenting evidence of Iran’s past research relevant to nuclear weapon design – the so-called “possible military dimensions (PMD).” The report outlines activities like explosives testing, warhead design work, and procurement efforts that suggest Iran had a coordinated weapons program pre-2004​en.wikipedia.org\n. It also notes some of these activities may have continued past 2003​armscontrol.org\n. The IAEA cannot conclude all Iranian nuclear material is for peaceful use​en.wikipedia.org\n. Iran denies seeking weapons, dismissing the evidence as forged. The report heightens international concern and leads to intensified sanctions (e.g., the EU oil embargo of 2012) and pushes Iran to eventually enter serious negotiations to resolve the PMD issue."
      }
    },
    {
      "start_date": {
        "year": 2012,
        "month": 1,
        "day": 9,
        "display_date": "Jan 9, 2012"
      },
      "text": {
        "headline": "Fordow Enrichment to 20%",
        "text": "The IAEA confirms that Iran has begun enriching uranium to 20% at the underground Fordow site near Qom​en.wikipedia.org\n. Tehran had announced the Fordow facility’s 20% production as part of its plan to fuel the Tehran Research Reactor after foreign fuel supply ran out. Moving 20% enrichment to Fordow – a fortified bunker – raises the stakes: the site is hard to attack, and 20% enriched UF₆ can be relatively quickly boosted to weapons-grade. The U.S. and Europe condemn the step. This development, along with the 2011 IAEA PMD report, leads to unprecedented sanctions: in early 2012, the EU bans Iranian oil imports and the SWIFT network disconnects Iranian banks, aiming to pressure Iran back into talks."
      }
    },
    {
      "start_date": {
        "year": 2013,
        "month": 11,
        "day": 24,
        "display_date": "Nov 24, 2013"
      },
      "text": {
        "headline": "Interim Deal – Joint Plan of Action",
        "text": "After the election of Hassan Rouhani (a pragmatist) as Iran’s president, Iran and the P5+1 (US, UK, France, Russia, China + Germany) sign the Joint Plan of Action (JPOA) – a six-month interim nuclear deal​en.wikipedia.org\n. Under the JPOA, Iran freezes key aspects of its program and rolls back certain elements: e.g. it stops enriching above 5%, neutralizes its 20% stockpile, and halts major expansion of enrichment capacity​armscontrol.org\n. In return, Iran receives modest sanctions relief (unfreezing of some oil revenue and suspension of certain trade sanctions)​armscontrol.org\n. The deal, effective January 20, 2014, buys time to negotiate a comprehensive solution. It marks the first diplomatic breakthrough in a decade, significantly de-escalating tensions and paving the way to the eventual 2015 JCPOA."
      }
    },
    {
      "start_date": {
        "year": 2014,
        "month": 1,
        "day": 20,
        "display_date": "Jan 20, 2014"
      },
      "text": {
        "headline": "JPOA Implemented: Iran Pauses Program",
        "text": "Implementation Day of the interim JPOA: IAEA inspectors verify Iran has halted 20% enrichment, disconnected cascades, and begun diluting or converting its 20% UF₆ stockpile​armscontrol.org\n​armscontrol.org\n. Iran also caps its 3.5% LEU stock and stops installing new centrifuges. In exchange, the U.S. and EU lift or suspend certain sanctions (on petrochemicals, gold trade, autos) and release several billion dollars of Iran’s frozen assets​armscontrol.org\n​armscontrol.org\n. The IAEA is granted more access, reporting Iran’s compliance. This successful initial step builds confidence as the parties intensify talks for a final accord. (The interim deal is extended twice as negotiators hammer out complex details for a comprehensive agreement by 2015.)"
      }
    },
    {
      "start_date": {
        "year": 2015,
        "month": 7,
        "day": 14,
        "display_date": "Jul 14, 2015"
      },
      "text": {
        "headline": "JCPOA – The Iran Nuclear Deal",
        "text": "Iran and the P5+1 finalize the Joint Comprehensive Plan of Action (JCPOA) in Vienna​en.wikipedia.org\n. This landmark agreement imposes far-reaching constraints and transparency on Iran’s nuclear program: Iran reduces its centrifuges by ~ two-thirds (to ~5,000 IR-1 machines) and limits enrichment to 3.67% for 15 years​en.wikipedia.org\n; it ships out ~97% of its LEU stockpile; converts Fordow into a research facility (no enrichment); and disables the Arak heavy-water reactor by removing and filling its core with concrete. Iran also accepts the Additional Protocol and robust IAEA inspections (including continuous monitoring of key sites)​armscontrol.org\n. In return, all nuclear-related U.N., EU, and U.S. sanctions are lifted, unlocking tens of billions in assets and oil revenue​en.wikipedia.org\n. On July 20, 2015, UN Resolution 2231 unanimously endorses the JCPOA, making it legally binding on the international community​en.wikipedia.org\n. The deal is hailed as a diplomatic victory preventing an Iranian bomb, while Iran’s leaders (President Rouhani and Supreme Leader Khamenei) frame it as recognition of Iran’s nuclear rights and a chance to rehabilitate its economy."
      }
    },
    {
      "start_date": {
        "year": 2016,
        "month": 1,
        "day": 16,
        "display_date": "Jan 16, 2016"
      },
      "text": {
        "headline": "JCPOA Implementation Day",
        "text": "The IAEA confirms that Iran has fulfilled its major JCPOA obligations: Iran shipped 11+ tons of LEU out of the country, dismantled over 13,000 centrifuges, and rendered the Arak reactor core inoperable​armscontrol.org\n​armscontrol.org\n. Consequently, “Implementation Day” is declared​armscontrol.org\n. All nuclear sanctions are lifted: Iran rejoins the global financial system, oil exports surge, and billions in frozen funds are released​armscontrol.org\n​armscontrol.org\n. President Rouhani praises this as a triumph of “win-win” diplomacy, and Iran begins to reap economic benefits. The IAEA continues to monitor Iran’s remaining nuclear activities under the most intrusive verification regime ever implemented in Iran. (Iran’s stockpile of UF₆ is under 300 kg of 3.67% material, and its enrichment capacity is capped.) U.S. President Barack Obama lauds the JCPOA as preventing a war and blocking all pathways to an Iranian nuclear weapon."
      }
    },
    {
      "start_date": {
        "year": 2017,
        "month": 10,
        "day": 13,
        "display_date": "Oct 13, 2017"
      },
      "text": {
        "headline": "Trump Decertifies Iran’s Compliance",
        "text": "The JCPOA faces new strain as U.S. President Donald Trump announces he will not certify Iran’s compliance under America’s domestic Iran Nuclear Agreement Review Act (INARA)​armscontrol.org\n. While the IAEA repeatedly found Iran in compliance, Trump claims Iran is violating the “spirit” of the deal – citing continued missile tests and regional activities​armscontrol.org\n​armscontrol.org\n. This move does not cancel the JCPOA outright, but it opens a 60-day window for the U.S. Congress to potentially re-impose sanctions. (Congress takes no such action.) European allies issue statements reaffirming support for the accord​armscontrol.org\n. Iran, under President Rouhani, condemns Trump’s stance but continues to abide by the JCPOA terms for now. Trump’s decertification foreshadows the U.S.’s eventual withdrawal and significantly heightens uncertainty about the deal’s future."
      }
    },
    {
      "start_date": {
        "year": 2018,
        "month": 4,
        "day": 30,
        "display_date": "Apr 30, 2018"
      },
      "text": {
        "headline": "Netanyahu’s Archive Revelations",
        "text": "Israel’s Prime Minister Benjamin Netanyahu gives a televised presentation unveiling what he calls Iran’s secret “Atomic Archive,” obtained by Israeli intelligence​en.wikipedia.org\n. He displays files and CDs allegedly taken from a Tehran warehouse, claiming they prove Iran had an organized nuclear weapons program (Project Amad pre-2003) and that Iran lied to the IAEA about past weaponization work. While much of the material covers the pre-2004 period (already suspected by the IAEA), Netanyahu argues that Iran kept this know-how to potentially resume a weapons program​en.wikipedia.org\n. The presentation comes just ahead of a U.S. decision on the JCPOA and bolsters hardliners’ case against the deal. Iran rejects Netanyahu’s claims as “childish” propaganda. The IAEA later acknowledges receiving Israel’s documents; it eventually concludes (in 2015) that Iran had a coordinated weapons program up to 2003. Netanyahu’s dramatic reveal influences U.S. domestic debate, underscoring the risk of Iran’s latent weapons knowledge."
      }
    },
    {
      "start_date": {
        "year": 2018,
        "month": 5,
        "day": 8,
        "display_date": "May 8, 2018"
      },
      "text": {
        "headline": "United States Withdraws from JCPOA",
        "text": "President Trump unilaterally withdraws the United States from the JCPOA​en.wikipedia.org\n, calling it a “disaster” that fails to stop Iran’s malign behavior. He re-imposes all U.S. nuclear sanctions on Iran, ending U.S. compliance with Resolution 2231. This decision – taken despite Iran’s verified compliance – is condemned by Europe, Russia, and China, which remain in the deal. Within months, the U.S. launches a “maximum pressure” sanctions campaign, targeting Iran’s oil exports, banks, and industries. Iran’s economy suffers a severe downturn. Tehran initially stays in the JCPOA, hoping the other parties can compensate. For a year, Iran continues full compliance, seeking diplomatic solutions. However, by mid-2019, faced with a failing economy and little relief from the remaining JCPOA parties, Iran begins to resume elements of its nuclear program in protest."
      }
    },
    {
      "start_date": {
        "year": 2019,
        "month": 5,
        "day": 8,
        "display_date": "May 8, 2019"
      },
      "text": {
        "headline": "Iran Reduces Compliance (“Phase 1”)",
        "text": "Exactly one year after the U.S. exit, President Hassan Rouhani announces Iran will cease adhering to some JCPOA limits​armscontrol.org\n. He gives Europe, Russia, and China a 60-day ultimatum to deliver economic relief or Iran will incrementally break free of the deal. In this first step, Iran stops observing the JCPOA’s caps on its stockpile of low-enriched uranium (300 kg) and heavy water (130 tons)​armscontrol.org\n​armscontrol.org\n. Over the next weeks, Iran begins accumulating more LEU and heavy water than allowed. Rouhani emphasizes Iran is not abandoning the JCPOA yet, but will scale back its compliance every 60 days if sanctions are not eased​armscontrol.org\n. The remaining parties set up a barter system (INSTEX) to facilitate some trade, but it provides limited benefit."
      }
    },
    {
      "start_date": {
        "year": 2019,
        "month": 7,
        "day": 1,
        "display_date": "Jul 1, 2019"
      },
      "text": {
        "headline": "Breaching Limits: Stockpile & Purity (“Phase 2”)",
        "text": "The IAEA confirms Iran’s LEU stockpile has exceeded 300 kg of 3.67% enriched UF₆ – violating the JCPOA’s key limit​timesofisrael.com\n. A week later, Iran increases enrichment level to 4.5% U-235, above the 3.67% cap​timesofisrael.com\n. These moves (the second phase of Iran’s response) significantly reduce Iran’s breakout time. European powers invoke the JCPOA’s dispute mechanism, urging Iran to reverse course. Iran argues it is exercising “remedial” rights in response to U.S. sanctions and European inaction. By September 2019, Iran also begins operating advanced centrifuges for R&D, beyond JCPOA limits. The deal is increasingly eroding: France leads efforts to offer Iran economic incentives (a proposed $15 billion credit line) to come back into full compliance, but no agreement is reached at this time."
      }
    },
    {
      "start_date": {
        "year": 2019,
        "month": 11,
        "day": 7,
        "display_date": "Nov 7, 2019"
      },
      "text": {
        "headline": "Fordow Facility Reactivated (“Phase 4”)",
        "text": "In its fourth step away from the JCPOA, Iran resumes uranium enrichment at Fordow. On Nov. 7, the AEOI feeds UF₆ gas into cascades of 1,044 IR-1 centrifuges installed in the fortified Fordow plant​reuters.com\n. Under the JCPOA, Fordow was supposed to be a research site with no enrichment for 15 years – now Iran is turning it back into an active enrichment facility. IAEA inspectors are on-site to witness the reactivation​reuters.com\n. Iran enriches to about 4.5% at Fordow, adding to its output from Natanz. IAEA Director-General Grossi later notes this move transforms Fordow from a permitted research center into a production site, dealing a serious blow to the deal​reuters.com\n. The remaining JCPOA parties warn Iran that these breaches jeopardize any chance of saving the agreement, and the U.S. imposes additional sanctions on Iran’s nuclear organization."
      }
    },
    {
      "start_date": {
        "year": 2020,
        "month": 1,
        "day": 5,
        "display_date": "Jan 5, 2020"
      },
      "text": {
        "headline": "Iran Exits JCPOA Limits (“Phase 5”)",
        "text": "In the wake of a U.S. airstrike that killed General Qassem Soleimani, Iran’s government declares it will no longer be bound by any operational restrictions of the JCPOA​armscontrol.org\n. Tehran’s Jan 5 statement ends limits on centrifuge numbers, enrichment level, and stockpile size (though Iran says it will continue cooperating with the IAEA on safeguards)​armscontrol.org\n. Effectively, Iran is no longer constrained by the deal, apart from basic NPT obligations. This is Iran’s most significant escalation, dubbed “Phase 5,” essentially leaving the JCPOA framework (although Iran stops short of formally renouncing the deal and later expresses readiness to return if U.S. sanctions are lifted). Over the next months, Iran installs advanced centrifuges and enriches beyond 4.5%, while the IAEA continues monitoring under less rigorous conditions. The JCPOA is widely considered collapsed at this point, pending potential revival in future talks."
      }
    },
    {
      "start_date": {
        "year": 2020,
        "month": 7,
        "day": 2,
        "display_date": "Jul 2, 2020"
      },
      "text": {
        "headline": "Natanz Explosion – Sabotage",
        "text": "A mysterious explosion and fire devastates a building at the Natanz enrichment complex​aljazeera.com\n. The damaged structure is later revealed to be a new centrifuge assembly workshop. Iranian officials call it an act of “nuclear terrorism”​aljazeera.com\n and hint at Israeli or U.S. involvement. Satellite images and Iranian investigations indicate the blast was likely caused by sabotage (explosives). The attack severely sets back Iran’s centrifuge development – destroying or damaging prototypes of advanced machines. Iran vows revenge but takes no overt action, while proceeding to rebuild more securely. This incident, following several others (including unexplained blasts at other facilities), underscores the shadow war against Iran’s nuclear program. Despite the setback, Iran’s enrichment at Natanz resumes using older infrastructure, and by late 2020 Iran begins constructing a new underground assembly hall at Natanz to replace the destroyed one​aljazeera.com\n."
      }
    },
    {
      "start_date": {
        "year": 2020,
        "month": 11,
        "day": 27,
        "display_date": "Nov 27, 2020"
      },
      "text": {
        "headline": "Fakhrizadeh Assassination",
        "text": "Mohsen Fakhrizadeh, a senior Iranian nuclear scientist long suspected of masterminding past weapons research, is assassinated in a daytime ambush near Tehran​reuters.com\n. Gunmen attack his convoy and Fatally wound Fakhrizadeh, who dies in hospital​reuters.com\n. Iranian officials (including President Rouhani and military advisers) blame Israel and vow retaliation​reuters.com\n. Fakhrizadeh had been identified by Western intelligence as a key figure in Iran’s pre-2004 warhead program (the Amad Plan)​reuters.com\n. His killing – widely attributed to Israel – is seen as an attempt to hinder any revived nuclear weapons work and to complicate U.S. President-elect Joe Biden’s plans to re-engage with Iran​reuters.com\n. Iran responds by accelerating legislation to expand its nuclear program (leading to the 2021 enrichment to 20% and reduced cooperation). The assassination is a major blow to Iran’s scientific community and heightens tensions in the final weeks of the Trump administration."
      }
    },
    {
      "start_date": {
        "year": 2021,
        "month": 1,
        "day": 4,
        "display_date": "Jan 4, 2021"
      },
      "text": {
        "headline": "20% Enrichment Resumes at Fordow",
        "text": "Iran fulfills a requirement of a new law (“Strategic Action Plan”) passed by its parliament: it begins enriching uranium to 20% U-235 at the Fordow underground site, breaching the JCPOA’s 3.67% limit​aljazeera.com\n. The move, confirmed on January 4, is Iran’s most significant escalation since halting JCPOA compliance. Iran quickly produces a small quantity of 20% UF₆ for storage​aljazeera.com\n. This step is intended to pressure Europe and the new U.S. administration (of Joe Biden) by creating new facts on the ground. Tehran suggests these breaches are reversible if sanctions are lifted. Supreme Leader Khamenei even signals Iran might go to 60% if needed. Western powers decry the action as provocative. Over the next months, Iran installs additional cascades of IR-2m and IR-4 centrifuges at Natanz, further expanding capacity (also in violation of JCPOA caps, per the December 2020 Iranian law)​en.wikipedia.org\n. The Biden administration expresses willingness to rejoin the JCPOA if Iran returns to compliance, but a standoff ensues over who moves first."
      }
    },
    {
      "start_date": {
        "year": 2021,
        "month": 2,
        "day": 23,
        "display_date": "Feb 23, 2021"
      },
      "text": {
        "headline": "Monitoring Curtailed",
        "text": "Iran suspends the Additional Protocol and JCPOA-specific monitoring measures granted to the IAEA​armscontrol.org\n​armscontrol.org\n. This follows the Iranian law requiring reduced cooperation if sanctions were not lifted by February. As of Feb 23, Iran stops allowing snap inspections of undeclared sites and disables certain online monitoring (like live camera feeds and electronic seals)​armscontrol.org\n​armscontrol.org\n. To mitigate the impact, IAEA Director-General Rafael Grossi negotiates a temporary 3-month arrangement: Iran will continue recording surveillance data and will hand it over to the IAEA if sanctions are lifted within that period​armscontrol.org\n​armscontrol.org\n. Otherwise, Iran will erase the data. This “firewall” keeps hope alive for restoring the JCPOA. Grossi warns that without an extension or restoration of monitoring, the IAEA’s visibility into Iran’s program will be severely diminished. (The interim monitoring deal is extended once and then expires in June 2021, after which some gaps in surveillance begin to emerge.)"
      }
    },
    {
      "start_date": {
        "year": 2021,
        "month": 4,
        "day": 11,
        "display_date": "Apr 11, 2021"
      },
      "text": {
        "headline": "Natanz Sabotage – Power Outage",
        "text": "Just as Iran began using new advanced centrifuges at Natanz, a major sabotage attack struck the facility’s electrical grid on Apr 11, causing a blackout and destroying or damaging a substantial number of centrifuges. Iran’s nuclear chief Salehi calls it an act of “nuclear terrorism” aimed at derailing ongoing negotiations​aljazeera.com\n​aljazeera.com\n. Western media, citing intelligence sources, attribute the attack to Israel’s Mossad. The incident, coming a day after Iran’s “Nuclear Technology Day” showcase, knocks out the power feeding thousands of centrifuges – reportedly wrecking IR-1 machines and potentially IR-2m’s. Iran rapidly labels the attack a sabotage that will be answered “in due time”​aljazeera.com\n. In the short term, Iran compensates by installing replacement centrifuges (including more advanced units). Strategically, this sabotage hardens Iran’s resolve to strengthen its program’s security and may have spurred Iran’s decision to enrich at 60% as a form of retaliation and leverage in the Vienna talks that were ongoing to restore the JCPOA."
      }
    },
    {
      "start_date": {
        "year": 2021,
        "month": 4,
        "day": 13,
        "display_date": "Apr 13, 2021"
      },
      "text": {
        "headline": "60% Enrichment – Near Weapons-Grade",
        "text": "Following the Natanz incident, Iran’s chief negotiator Abbas Araghchi announces that Iran will start enriching uranium to 60% U-235​reuters.com\n – a level never reached before by Iran and close to the ~90% needed for weapons. Within days, Iran feeds UF₆ into advanced IR-6 centrifuges at Natanz and by April 17 produces its first batch of 60% enriched uranium​reuters.com\n. President Rouhani insists the 60% is for making medical isotopes and a response to sabotage​reuters.com\n, but the move is highly symbolic – crossing a new threshold. The U.S. and European states call this escalation “provocative”​reuters.com\n and a serious breach of the JCPOA. Technically, 60% enrichment significantly shortens the time to reach weapons-grade if Iran decided to do so. However, Iran continues to limit the quantity and says it will reverse 60% enrichment if a deal is reached. This bold step occurs amid ongoing indirect negotiations in Vienna on restoring the JCPOA, and is widely seen as Iran boosting its leverage. (As of early 2023, Iran had about 70 kg of 60%-enriched UF₆ accumulated​reuters.com\n​reuters.com\n.)"
      }
    },
    {
      "start_date": {
        "year": 2021,
        "month": 6,
        "day": 18,
        "display_date": "Jun 18, 2021"
      },
      "text": {
        "headline": "Hardliner Raisi Elected President",
        "text": "Ebrahim Raisi, a conservative cleric and judiciary chief favored by Supreme Leader Khamenei, wins Iran’s presidential election in a landslide​timesofisrael.com\n. Raisi’s victory (with ~62% of the vote) ushers in a more hardline administration, replacing Rouhani’s term-limited moderate government. He pledges to continue Iran’s nuclear advancements and links any return to the JCPOA to a lifting of U.S. sanctions, stating he will not negotiate just for the sake of talks. Under Raisi (who takes office in August 2021), Iran adopts a tougher stance in the Vienna negotiations. By the time talks resume in late 2021, Iran expands its demands and accelerates its nuclear program further, putting pressure on the U.S. The Raisi era thus far has seen Iran refuse to concede on issues like the IAEA’s probe of undeclared sites, contributing to prolonged impasse in JCPOA restoration efforts. (However, Iran and the IAEA did strike a limited agreement in early 2023 to reconnect some monitoring equipment.)"
      }
    },
    {
      "start_date": {
        "year": 2022,
        "month": 6,
        "day": 8,
        "display_date": "Jun 8, 2022"
      },
      "text": {
        "headline": "IAEA Censure & Iran’s Retaliation",
        "text": "After stalled talks and unresolved questions about uranium traces at undeclared sites, the IAEA Board of Governors passes a resolution censuring Iran for not cooperating fully with inspectors​reuters.com\n (the first such rebuke since 2020). In response, Iran shuts off multiple IAEA cameras and monitors that were installed under the JCPOA. In total, Iran removes 27 surveillance cameras from various nuclear facilities​reuters.com\n – essentially all the “extra” monitoring beyond basic safeguards that the JCPOA provided, according to IAEA chief Grossi​reuters.com\n​reuters.com\n. Grossi warns that if these devices remain off, the IAEA will lose the continuity of knowledge of Iran’s activities within a few weeks​reuters.com\n, calling it potentially a “fatal blow” to reviving the deal​reuters.com\n​reuters.com\n. Iran also begins feeding gas into a new cascade of advanced IR-6 centrifuges at Natanz that had been prepared but not yet operational. West European diplomats say Iran’s response is “extremely regrettable” and urge Tehran to return to compliance. This tit-for-tat dramatically complicates efforts to restore the JCPOA, as much of the verification architecture was dismantled. (In late 2022, another IAEA censure led to Iran removing additional monitoring equipment.)"
      }
    },
    {
      "start_date": {
        "year": 2023,
        "month": 2,
        "day": 1,
        "display_date": "Feb 1, 2023"
      },
      "text": {
        "headline": "83.7% Enriched Particles Detected",
        "text": "IAEA inspectors at Iran’s Fordow plant find uranium particles enriched up to 83.7% U-235 – just shy of weapons-grade​reuters.com\n. The discovery, made during a January inspection and reported in February 2023, occurs in the product lines of interlinked centrifuge cascades that were enriching to 60%​reuters.com\n. The IAEA chides Iran for not declaring these “unintended fluctuations” in advance​reuters.com\n. Iran claims the spike was accidental, caused by technical “swings” when feeding new UF₆ into the centrifuges​reuters.com\n. Regardless, the Agency demands explanations, and the incident underscores how close Iran’s enrichment level has crept toward bomb-grade. By this time, Iran’s stockpile of 60% material had grown to ~87.5 kg​reuters.com\n – an alarming development from a nonproliferation standpoint. This revelation adds urgency to stalled negotiations; Western officials warn that Iran’s program is now more advanced than ever, and Grossi says Iran has amassed enough 60% and 20% uranium that, if further enriched, could yield several bombs’ worth of fissile material​securitycouncilreport.org\n. (Iran maintains it still has no intention to build a weapon.)"
      }
    },
    {
      "start_date": {
        "year": 2023,
        "month": 3,
        "day": 4,
        "display_date": "Mar 4, 2023"
      },
      "text": {
        "headline": "Temporary Monitoring Deal",
        "text": "IAEA Director-General Grossi visits Tehran and secures a “technical understanding” to mitigate the monitoring gap​armscontrol.org\n​armscontrol.org\n. In a March 4 joint statement, Iran agrees to reconnect some surveillance equipment and allow the IAEA to increase verification for a limited period​armscontrol.org\n​armscontrol.org\n. For instance, Iran permits the re-installation of a few cameras at key sites and the restoration of certain data collection (which had been halted in June 2022). Grossi calls this a “reasonable” interim result to stabilize the situation​armscontrol.org\n. However, crucial details (in a confidential annex) are not public, and Iran still does not grant full access requested by the IAEA. This step slightly eases tensions ahead of the March 2023 IAEA Board meeting and is welcomed by European diplomats. Yet, as months pass, the IAEA reports only partial implementation – many cameras remain off and the Agency’s inquiry into uranium traces at old sites sees only limited progress. The IAEA warns in May and again in September 2023 that cooperation is still far from sufficient, and by late 2023 Grossi states that monitoring continuity has been broken due to the prolonged absence of JCPOA measures. Nonetheless, the March 2023 visit opens the door to continuing dialogue and perhaps a platform for future JCPOA revival talks under the more hardline Raisi administration."
      }
    },
    {
      "start_date": {
        "year": 2023,
        "month": 11,
        "day": 1,
        "display_date": "Nov 1, 2023"
      },
      "text": {
        "headline": "Iran Warned on Transparency",
        "text": "As Iran’s program nears a decade since JCPOA limits, the IAEA and Western powers raise alarms about diminishing oversight. In November 2023, the United States, Britain, France, and Germany issue a joint statement urging Iran to restore all monitoring equipment and to cooperate fully with the IAEA’s safeguards investigation​rferl.org\n. Grossi cautions that Iran’s lack of transparency is unacceptable and that the IAEA’s understanding of Iran’s nuclear work is declining with each passing month of limited access​reuters.com\n​reuters.com\n. The IAEA Board stops short of a new censure (to avoid derailing possible U.S.-Iran indirect contacts), but the message is clear that Iran’s nuclear advances – especially the Fordow 83.7% finding and expanded centrifuge use – are eroding confidence. Iran, for its part, allows a few moderated gestures: e.g. in November 2023 Iran lets the IAEA reinstall some cameras at a nuclear facility and reconnect an online enrichment monitor at Natanz​armscontrol.org\n, partially reversing the June 2022 shutdown. However, by the end of 2024, the bulk of JCPOA-specific transparency measures remain offline. Diplomacy continues quietly: Oman and Qatar facilitate talks between U.S. and Iranian officials throughout 2023-24 aimed at limiting Iran’s program to prevent a crisis. As of early 2025, Iran’s enrichment capability and stockpiles are the highest they’ve ever been, but Iran has stayed within the NPT and the IAEA retains baseline safeguards. The future of Iran’s nuclear program – whether a return to mutual compliance with the JCPOA or a drift toward a nuclear threshold status – remains a pressing international issue."
      }
    }
  ]
}